# Experiencing anomalies of un-normalized database

### For each cell, please writing down your SQL statements as requested.

### Creating an Employees table that has the same schema as Slide #2 of Lecture Slides-1. 

(S:SSN, N: Name, L: Lot number, R: Rating, W: Wage, H: Hourly_worked); Primary key is SSN.

In [ ]:
# List your SQL statement for table creation here 
CREATE  TABLE IF NOT EXISTS jch5x8.Employees(
        SSN INT PRIMARY KEY,
        name VARCHAR(50),
        lot INT,
        rating INT NOT NULL,
        hrly_wages REAL,
        hrs_worked REAL);

### Insert 20 tuples that have even distributions of ratings from 1 to 5.

The only company policy provided by your client is "employees have the same rating should have the same wage."

Show all tuples and sort them based on rating in ascending order.

In [ ]:
# List your SQL statements for INSERT and list all tuples
INSERT INTO jch5x8.Employees (SSN, name, lot, rating, hrly_wages, hrs_worked) VALUES
    (531515421, 'Vera', 24, 5, 12, 33.9),
    (429932160, 'Aubert', 8, 5, 12, 39.9),
    (440662487, 'Illarion', 6, 3, 9.5, 39.4),
    (408098083, 'Aifric', 5, 1, 8.5, 35),
    (576889349, 'Ève', 8, 2, 8, 38.4),
    (400329204, 'Hedvig', 28, 4, 10, 30),
    (501805927, 'Donnchadh', 18, 1, 8.5, 35.9),
    (525759852, 'Marion', 12, 4, 10, 34.5),
    (135137534, 'Bente', 13, 4, 10, 38),
    (469230198, 'Arlette', 12, 3, 9.5, 30.3),
    (247215030, 'Kresten', 17, 5, 12, 36.8),
    (545376537, 'Gobnet', 5, 2, 8, 37),
    (224546191, 'Yanis', 24, 4, 10, 35.25),
    (400166538, 'Amalie', 1, 1, 8.5, 39.25),
    (363369063, 'Rosa', 20, 2, 8, 34.7),
    (159829237, 'Miriam', 29, 1, 8.5, 37),
    (522396865, 'Jaromíra', 26, 5, 12, 35.5),
    (417728015, 'Gurutze', 22, 3, 9.5, 33.4),
    (520087141, 'Goizane', 18, 3, 9.5, 32),
    (306562516, 'Bistra', 16, 2, 8, 37.9);

dsa_student=> select * from jch5x8.Employees order by rating;
    ssn    |   name    | lot | rating | hrly_wages | hrs_worked
-----------+-----------+-----+--------+------------+------------
 408098083 | Aifric    |   5 |      1 |        7.5 |         35
 501805927 | Donnchadh |  18 |      1 |        7.5 |       35.9
 400166538 | Amalie    |   1 |      1 |        7.5 |      39.25
 159829237 | Miriam    |  29 |      1 |        7.5 |         37
 576889349 | Ève       |   8 |      2 |          8 |       38.4
 363369063 | Rosa      |  20 |      2 |          8 |       34.7
 545376537 | Gobnet    |   5 |      2 |          8 |         37
 306562516 | Bistra    |  16 |      2 |          8 |       37.9
 469230198 | Arlette   |  12 |      3 |        9.5 |       30.3
 440662487 | Illarion  |   6 |      3 |        9.5 |       39.4
 417728015 | Gurutze   |  22 |      3 |        9.5 |       33.4
 520087141 | Goizane   |  18 |      3 |        9.5 |         32
 525759852 | Marion    |  12 |      4 |         10 |       34.5
 224546191 | Yanis     |  24 |      4 |         10 |      35.25
 400329204 | Hedvig    |  28 |      4 |         10 |         30
 135137534 | Bente     |  13 |      4 |         10 |         38
 247215030 | Kresten   |  17 |      5 |         12 |       36.8
 429932160 | Aubert    |   8 |      5 |         12 |       39.9
 531515421 | Vera      |  24 |      5 |         12 |       33.9
 522396865 | Jaromíra  |  26 |      5 |         12 |       35.5
(20 rows)

### Copy this Employees Table to Keep_Employees Table .

Hint: Using CREATE TABLE new_table AS SELECT * FROM original_table;

In [ ]:
# SQL Statement
CREATE TABLE jch5x8.Keep_Employees AS SELECT * FROM jch5x8.Employees;

### Task 1: Use UPDATE statement on the original table (Employees) to give a raise to an employee to a new and extremely high wage. Assuming this wage is much higher than the max wage you have in the database.

* List the tuples again based on ratings (ascending order) and comment on whether or not the company policy has been preserved. What could be UPDATE anomalies you experience here.

In [ ]:
# SQL statement
UPDATE jch5x8.Employees SET hrly_wages = 100 WHERE name = 'Amalie';

dsa_student=> select * from jch5x8.Employees order by rating;
    ssn    |   name    | lot | rating | hrly_wages | hrs_worked
-----------+-----------+-----+--------+------------+------------
 400166538 | Amalie    |   1 |      1 |        100 |      39.25
 408098083 | Aifric    |   5 |      1 |        7.5 |         35
 501805927 | Donnchadh |  18 |      1 |        7.5 |       35.9
 159829237 | Miriam    |  29 |      1 |        7.5 |         37
 576889349 | Ève       |   8 |      2 |          8 |       38.4
 306562516 | Bistra    |  16 |      2 |          8 |       37.9
 545376537 | Gobnet    |   5 |      2 |          8 |         37
 363369063 | Rosa      |  20 |      2 |          8 |       34.7
 417728015 | Gurutze   |  22 |      3 |        9.5 |       33.4
 520087141 | Goizane   |  18 |      3 |        9.5 |         32
 469230198 | Arlette   |  12 |      3 |        9.5 |       30.3
 440662487 | Illarion  |   6 |      3 |        9.5 |       39.4
 224546191 | Yanis     |  24 |      4 |         10 |      35.25
 135137534 | Bente     |  13 |      4 |         10 |         38
 525759852 | Marion    |  12 |      4 |         10 |       34.5
 400329204 | Hedvig    |  28 |      4 |         10 |         30
 247215030 | Kresten   |  17 |      5 |         12 |       36.8
 429932160 | Aubert    |   8 |      5 |         12 |       39.9
 531515421 | Vera      |  24 |      5 |         12 |       33.9
 522396865 | Jaromíra  |  26 |      5 |         12 |       35.5
(20 rows)

# Add your comments
The company policy has not been preserved because Amalie still has a rating of 1 but an hourly wage of $100. Since the only policy is that rating determines hourly wage, I would expect the only two UPDATE anomalies would be changing a rating without changing the hourly wage to match or this case where the hourly wage is changed but not the rating.

### Task 2: Use INSERT statement on the original table (Employees) for two new employees. One follows the company policy to assign known wage and rating pair. The other is assigned a rating "5" but with a NULL value for the wage - the hiring manager has not decided the wage yet.  

* List the tuples again based on ratings (ascending order) and comment on whether or not the company policy has been preserved. What could be INSERT anomalies you experience here.

In [ ]:
# SQL statement
INSERT INTO jch5x8.Employees (SSN, name, lot, rating, hrly_wages, hrs_worked) VALUES
    (401662722, 'Věroslav', 4, 4, 10, 33.9),
    (425346068, 'Adrijana', 18, 5, NULL, 39.9);

dsa_student=> select * from jch5x8.Employees order by rating;
    ssn    |   name    | lot | rating | hrly_wages | hrs_worked
-----------+-----------+-----+--------+------------+------------
 400166538 | Amalie    |   1 |      1 |        100 |      39.25
 159829237 | Miriam    |  29 |      1 |        7.5 |         37
 501805927 | Donnchadh |  18 |      1 |        7.5 |       35.9
 408098083 | Aifric    |   5 |      1 |        7.5 |         35
 363369063 | Rosa      |  20 |      2 |          8 |       34.7
 306562516 | Bistra    |  16 |      2 |          8 |       37.9
 576889349 | Ève       |   8 |      2 |          8 |       38.4
 545376537 | Gobnet    |   5 |      2 |          8 |         37
 520087141 | Goizane   |  18 |      3 |        9.5 |         32
 469230198 | Arlette   |  12 |      3 |        9.5 |       30.3
 440662487 | Illarion  |   6 |      3 |        9.5 |       39.4
 417728015 | Gurutze   |  22 |      3 |        9.5 |       33.4
 224546191 | Yanis     |  24 |      4 |         10 |      35.25
 525759852 | Marion    |  12 |      4 |         10 |       34.5
 400329204 | Hedvig    |  28 |      4 |         10 |         30
 401662722 | Věroslav  |   4 |      4 |         10 |       33.9
 135137534 | Bente     |  13 |      4 |         10 |         38
 425346068 | Adrijana  |  18 |      5 |            |       39.9
 429932160 | Aubert    |   8 |      5 |         12 |       39.9
 247215030 | Kresten   |  17 |      5 |         12 |       36.8
 522396865 | Jaromíra  |  26 |      5 |         12 |       35.5
 531515421 | Vera      |  24 |      5 |         12 |       33.9
(22 rows)

# Add your comments
The company policy was preserved for Věroslav because his hourly wage of $10 matches the other employees' hourly wage with a rating of 4. The company policy was not preserved for Adrijana because she was assigned a rating but no hourly wage. The INSERT anomalies would be adding employees with null hourly wages, null ratings, or mismatched ratings and hourly wages.

### Task 3: Use DELETE statement on the original table (Employees) for all employees from the lowest rating due to performance issues.   

* List the tuples again based on ratings (ascending order) and comment on whether or not the company policy has been preserved. What could be DELETE anomalies you experience here.

### Use INSERT statement on the original table (Employees) to add a new employee who will take the lowest rating (you just deleted) with the wage associating with that rating.

* Without looking at the Keep_Employees table, do you still remember the original wage for the lowest rating from the initial table?

In [ ]:
# SQL statement
DELETE FROM jch5x8.Employees WHERE rating = 1;

dsa_student=> select * from jch5x8.Employees order by rating;
    ssn    |   name   | lot | rating | hrly_wages | hrs_worked
-----------+----------+-----+--------+------------+------------
 363369063 | Rosa     |  20 |      2 |          8 |       34.7
 545376537 | Gobnet   |   5 |      2 |          8 |         37
 306562516 | Bistra   |  16 |      2 |          8 |       37.9
 576889349 | Ève      |   8 |      2 |          8 |       38.4
 417728015 | Gurutze  |  22 |      3 |        9.5 |       33.4
 520087141 | Goizane  |  18 |      3 |        9.5 |         32
 469230198 | Arlette  |  12 |      3 |        9.5 |       30.3
 440662487 | Illarion |   6 |      3 |        9.5 |       39.4
 401662722 | Věroslav |   4 |      4 |         10 |       33.9
 525759852 | Marion   |  12 |      4 |         10 |       34.5
 224546191 | Yanis    |  24 |      4 |         10 |      35.25
 135137534 | Bente    |  13 |      4 |         10 |         38
 400329204 | Hedvig   |  28 |      4 |         10 |         30
 425346068 | Adrijana |  18 |      5 |            |       39.9
 429932160 | Aubert   |   8 |      5 |         12 |       39.9
 247215030 | Kresten  |  17 |      5 |         12 |       36.8
 522396865 | Jaromíra |  26 |      5 |         12 |       35.5
 531515421 | Vera     |  24 |      5 |         12 |       33.9
(18 rows)

INSERT INTO jch5x8.Employees (SSN, name, lot, rating, hrly_wages, hrs_worked) VALUES
    (479182420, 'Valerie', 21, 1, 7.5, 36);

dsa_student=> select * from jch5x8.Employees order by rating;
    ssn    |   name   | lot | rating | hrly_wages | hrs_worked
-----------+----------+-----+--------+------------+------------
 479182420 | Valerie  |  21 |      1 |        7.5 |         36
 545376537 | Gobnet   |   5 |      2 |          8 |         37
 576889349 | Ève      |   8 |      2 |          8 |       38.4
 363369063 | Rosa     |  20 |      2 |          8 |       34.7
 306562516 | Bistra   |  16 |      2 |          8 |       37.9
 520087141 | Goizane  |  18 |      3 |        9.5 |         32
 469230198 | Arlette  |  12 |      3 |        9.5 |       30.3
 417728015 | Gurutze  |  22 |      3 |        9.5 |       33.4
 440662487 | Illarion |   6 |      3 |        9.5 |       39.4
 525759852 | Marion   |  12 |      4 |         10 |       34.5
 135137534 | Bente    |  13 |      4 |         10 |         38
 224546191 | Yanis    |  24 |      4 |         10 |      35.25
 401662722 | Věroslav |   4 |      4 |         10 |       33.9
 400329204 | Hedvig   |  28 |      4 |         10 |         30
 531515421 | Vera     |  24 |      5 |         12 |       33.9
 429932160 | Aubert   |   8 |      5 |         12 |       39.9
 247215030 | Kresten  |  17 |      5 |         12 |       36.8
 522396865 | Jaromíra |  26 |      5 |         12 |       35.5
 425346068 | Adrijana |  18 |      5 |            |       39.9
(19 rows)

# Add your comments
I do not see how company policy was not preserved here. Although there is a potential for the institutional loss of the information of what the hourly wage for rating 1 is, the company policy is that employees with the same rating have the same hourly wage. I could assign any unused wage to rating 1 and still comply with the policy as long as all new rating 1 employees received the same wage. So the DELETE anomalies are ones where we completely delete the relation between rating and hourly wage so that in the future it becomes hard or even impossible to create new records that comply with company policy AND match historical data. 

I remembered the original wage because I screwed it up the first time I inserted the tuples and wound up having to change it. I do understand the potential problem, though, because it could be months or years before that policy has to be applied again.

### Now you have experienced the anomalies due to redundancy and functional dependency (Rating -> Wage)



## Solutions via table decomposition

### Let's decompose the Keep_Employees table into two - which two?

* CREATE these two tables and make sure primary keys are properly assigned to each table. There will be one foreign key constraint. Of course we need to populate tuples to these two tables using SQL statements (no manual way, please.)

* List the tuples from both tables based on ratings (ascending order) and comment on the numbers of tuples of these two tables.

In [ ]:
# SQL statement
CREATE  TABLE IF NOT EXISTS jch5x8.Pay(
        rating INT PRIMARY KEY,
        hrly_wages REAL NOT NULL);

INSERT INTO jch5x8.Pay (rating, hrly_wages) VALUES
    (5, 12),
    (4, 10),
    (3, 9.5),
    (2, 8),
    (1, 7.5);

ALTER TABLE jch5x8.Keep_Employees 
DROP COLUMN hrly_wages,
ADD CONSTRAINT fk_Pay
    FOREIGN KEY (rating)
    REFERENCES Pay(rating);

dsa_student=> select * from jch5x8.Keep_Employees order by rating;
    ssn    |   name    | lot | rating | hrs_worked
-----------+-----------+-----+--------+------------
 408098083 | Aifric    |   5 |      1 |         35
 501805927 | Donnchadh |  18 |      1 |       35.9
 400166538 | Amalie    |   1 |      1 |      39.25
 159829237 | Miriam    |  29 |      1 |         37
 576889349 | Ève       |   8 |      2 |       38.4
 363369063 | Rosa      |  20 |      2 |       34.7
 545376537 | Gobnet    |   5 |      2 |         37
 306562516 | Bistra    |  16 |      2 |       37.9
 469230198 | Arlette   |  12 |      3 |       30.3
 440662487 | Illarion  |   6 |      3 |       39.4
 417728015 | Gurutze   |  22 |      3 |       33.4
 520087141 | Goizane   |  18 |      3 |         32
 525759852 | Marion    |  12 |      4 |       34.5
 224546191 | Yanis     |  24 |      4 |      35.25
 400329204 | Hedvig    |  28 |      4 |         30
 135137534 | Bente     |  13 |      4 |         38
 247215030 | Kresten   |  17 |      5 |       36.8
 429932160 | Aubert    |   8 |      5 |       39.9
 531515421 | Vera      |  24 |      5 |       33.9
 522396865 | Jaromíra  |  26 |      5 |       35.5
(20 rows)

dsa_student=> select * from jch5x8.Pay order by rating;
 rating | hrly_wages
--------+------------
      1 |        7.5
      2 |          8
      3 |        9.5
      4 |         10
      5 |         12
(5 rows)

# Add your comments
The tuples remained the same in the Keep_Employees table and there are only 5 in the Pay table. This has a couple of different implications. While creating another table adds a modicum of storage need, we potentially make up for it by eliminating repeating the same 5 hourly wages. This my not be a wash even with only 20 records, but for a company like Cerner thousands of employees it would make a large difference. When we are talking about sales records that can number in the tens of millions it is neccessary. The other implication is now if we want to change the hourly wage for a rating, we do it to one field in one record and it becomes true for all employees of that rating. We could, of course, write an update that changes every records with a rating n to hourly wage x and that would probably not be noticeably expensive over 20 tuples. Again, with a large corporation or sales data this kind of operation would be too expensive.


### Tasks 4-6 will use these two new tables.

### Task 4: Use UPDATE statement to give a raise to an employee to a new and extremely high wage. Assuming this wage is much higher than the max wage you have in the database.

* Is it possible? Comment on why this new setting can prevent UPDATE anomalies.

In [ ]:
# SQL statement
UPDATE jch5x8.Keep_Employees SET hrly_wages = 100 WHERE name = 'Amalie';
UPDATE jch5x8.Pay SET hrly_wages = 100 WHERE name = 'Amalie';

# Add your comments
I do not know how to even go about using a single update statement to change just one employee's hourly wage. I have seen examples of updating two tables, and can I think I can update the rating an eployee has to the raise I want, but it will affect every one else of that rating. Something like:
UPDATE  jch5x8.Pay
SET     hrly_wages = 100
WHERE   rating IN (
            SELECT  rating
            FROM    other_jch5x8.Keep_Employees
            WHERE   name = 'Amalie'
        );
So, I just modified the query I used before, which of course didn't work. The new setting is therefore useful in prefenting this UPDATE anomaly because one cannot arbitrarily defy to company policy and give one person a raise without changing their rating, or requires that to give that person the raise it must be granted to all with the same rating.

### Task 5: Use INSERT statement for two new employees. One follows the company policy to assign known wage and rating pair. The other is assigned a rating "5" but with a NULL value for the wage - the hiring manager has not decided the wage yet.  

* Is it possible? Comment on why this new setting can prevent INSERT anomalies.

In [ ]:
# SQL statement
WITH data(ssn, name, lot, rating, hrly_wages, hrs_worked) AS (
   VALUES
     (401662722, 'Věroslav', 4, 4, 10, 33.9),
     (425346068, 'Adrijana', 18, 5, NULL, 39.9)
   )
,ins1 AS (
   INSERT INTO jch5x8.Keep_Employees (ssn, name, lot, rating, hrs_worked)
   SELECT ssn, name, lot, rating, hrs_worked
   FROM   data
   RETURNING ssn
   )
INSERT INTO jch5x8.Pay (rating, hrly_wages)
SELECT  d.rating, d.hrly_wages
FROM    data d JOIN ins1
        USING (ssn);

# Add your comments
Again, I cannot even conceive of a way to attempt this with a single statement. So trying the first way of,
INSERT INTO jch5x8.Keep_Employees (SSN, name, lot, rating, hrly_wages, hrs_worked) VALUES
    (401662722, 'Věroslav', 4, 4, 10, 33.9),
    (425346068, 'Adrijana', 18, 5, NULL, 39.9);
could not possibly work because there is no longer an hrly_wages field. My code didn't work because it would't let me add another rating of 4. It would have failed when trying to add the second tuple as well both because it is trying to add rating 5 and because it is trying to add a NULL value into a field that does not accept null values.

### Task 6: Use DELETE statement for all employees from the lowest rating due to performance issues.   

* List the tuples again based on ratings (ascending order) and comment on whether or not the company policy has been preserved. What could be DELETE anomaly you experience here.

### Use INSERT statement to add a new employee who will take the lowest rating with the wage associating with that rating.

* Is it possible? Comment on why this new setting can prevent DELETE anomalies.

In [ ]:
# SQL statement
DELETE FROM jch5x8.Keep_Employees WHERE rating = 1;

# Add your comments
It is possible to delete them all and does not violate company policy. Although there are no longer any employees in the databse with a rating of 1, the institutional knowledge pertaining to the hourly wage of an employee with a 1 rating is preserved in the Pay table, thus preventing DELETE anomalies.

# Save your notebook, then `File > Close and Halt`